const studentsDatabase = {
    second: {
        scientific: {
               
  "2101": {
    "name": "ادم رضا خليل محمد  ",
    "scores": {
      "اللغة العربية": 40,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 25,
      "الأحياء": 25,
      "الفيزياء": 30,
      "الكيمياء": 20
    }
  },
  "2102": {
    "name": "بيشوي جورج صموئيل شاكر سلامة ",
    "scores": {
      "اللغة العربية": 42,
      "اللغة الأجنبية الأولى": 54,
      "الرياضيات": 27,
      "الأحياء": 29,
      "الفيزياء": 35,
      "الكيمياء": 48
    }
  },
  "2103": {
    "name": "زياد وائل محمد حلمي غزالي ",
    "scores": {
      "اللغة العربية": 45,
      "اللغة الأجنبية الأولى": 32,
      "الرياضيات": 38,
      "الأحياء": 29,
      "الفيزياء": 35,
      "الكيمياء": 48
    }
  },
  "2104": {
    "name": "عمر محمد حسن ابراهيم",
    "scores": {
      "اللغة العربية": 58,
      "اللغة الأجنبية الأولى": 56,
      "الرياضيات": 32,
      "الأحياء": 52,
      "الفيزياء": 46,
      "الكيمياء": 52
    }
  },
  "2105": {
    "name": "فارس وحيد محمد محمود ابراهيم داود",
    "scores": {
      "اللغة العربية": 40,
      "اللغة الأجنبية الأولى": 30,
      "الرياضيات": 32,
      "الأحياء": 35,
      "الفيزياء": 23,
      "الكيمياء": 45
    }
  },
  "2106": {
    "name": "محمد عبد المنعم محمد علي حلمي الكيلاني ",
    "scores": {
      "اللغة العربية": 69,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 40,
      "الأحياء": 50,
      "الفيزياء": 45,
      "الكيمياء": 48
    }
  },
  "2107": {
    "name": "محمود عماد الدين محمد محمود",
    "scores": {
      "اللغة العربية": 42,
      "اللغة الأجنبية الأولى": 33,
      "الرياضيات": 29,
      "الأحياء": 42,
      "الفيزياء": 35,
      "الكيمياء": 40
    }
  },
  "2110": {
    "name": "بسملة جميل محمد رياض ",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 45,
      "الأحياء": 48,
      "الفيزياء": 41,
      "الكيمياء": 42
    }
  },
  "2111": {
    "name": "حنين احمد سامي محمد ",
    "scores": {
      "اللغة العربية": 68,
      "اللغة الأجنبية الأولى": 58,
      "الرياضيات": 52,
      "الأحياء": 50,
      "الفيزياء": 49,
      "الكيمياء": 52
    }
  },
  "2112": {
    "name": "منه الله محمد ابراهيم محمد ",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 56,
      "الرياضيات": 52,
      "الأحياء": 56,
      "الفيزياء": 55,
      "الكيمياء": 51
    }
  },"2109": {
    "name": "يوسف وليد سعد ",
    "scores": {
      "اللغة العربية": 30,
      "اللغة الأجنبية الأولى": 40,
      "الرياضيات": 20,
      "الأحياء": 25,
      "الفيزياء": 10,
      "الكيمياء": 36
    }
  },"2108": {
    "name": "يحي ممدوح العمده يسين علي",
    "scores": {
      "اللغة العربية": 30,
      "اللغة الأجنبية الأولى": 45,
      "الرياضيات": 20,
      "الأحياء": 33,
      "الفيزياء": 24,
      "الكيمياء": 37
    }
  }
        }
        },
        literary: {
            "2113": {
                name: "يحي محمد حسن محمد",
                scores: {
                    "اللغة العربية": 41,
                    "اللغة الأجنبية الأولى": 40,
                    "الرياضيات": 32,
                    "علم النفس": 58,
                    "التاريخ": 42,
                    "الجغرافيا": 29
                }
            }
            // Add more literary students if there are any
        }
    }
};
