const studentsDatabase = {
            "first": {
                "214": {
                    "name": "مازن خالد حماده عبدالرحمن السمخراطي",
                    "scores": {
                        
                  "اللغة العربية": 60,
      "اللغة الإنجليزية": 59,
      "الرياضيات": 59,
      "العلوم المتكامله": 60,
      "التاريخ": 59,
      "الجغرافيا": 58
                        
                        
                        
                        
                    }
                },
                "12346": {
                    "name": "فاطمة أحمد حسن",
                    "scores": {
                        "اللغة العربية": 19,
                        "اللغة الإنجليزية": 18,
                        "الرياضيات": 17,
                        "الفيزياء": 18,
                        "الكيمياء": 19,
                        "الأحياء": 18,
                        "التاريخ": 17,
                        "الجغرافيا": 19
                    }
                }
            },
            "second": {
                "scientific": {
                    
                    
                    
                    
                    
                   
  {
  "2101": {
    "name": "ادم رضا خليل محمد  ",
    "scores": {
      "اللغة العربية": 40,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 25,
      "الأحياء": 25,
      "الفيزياء": 30,
      "الكيمياء": 20
    }
  },
  "2102": {
    "name": "بيشوي جورج صموئيل شاكر سلامة ",
    "scores": {
      "اللغة العربية": 61,
      "اللغة الأجنبية الأولى": 54,
      "الرياضيات": 25,
      "الأحياء": 45,
      "الفيزياء": 42,
      "الكيمياء": 48
    }
  },
  "2104": {
    "name": "عمر محمد حسن ابراهيم",
    "scores": {
      "اللغة العربية": 58,
      "اللغة الأجنبية الأولى": 56,
      "الرياضيات": 32,
      "الأحياء": 52,
      "الفيزياء": 46,
      "الكيمياء": 52
    }
  },
  "2105": {
    "name": "فارس وحيد محمد محمود ابراهيم داود",
    "scores": {
      "اللغة العربية": 40,
      "اللغة الأجنبية الأولى": 30,
      "الرياضيات": 32,
      "الأحياء": 35,
      "الفيزياء": 23,
      "الكيمياء": 45
    }
  },
  "2107": {
    "name": "محمود عماد الدين محمد محمود",
    "scores": {
      "اللغة العربية": 55,
      "اللغة الأجنبية الأولى": 57,
      "الرياضيات": 45,
      "الأحياء": 51,
      "الفيزياء": 50,
      "الكيمياء": 45
    }
  },
  "2110": {
    "name": "بسملة جميل محمد رياض ",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 45,
      "الأحياء": 48,
      "الفيزياء": 41,
      "الكيمياء": 42
    }
  },
  "2111": {
    "name": "حنين احمد سامي محمد ",
    "scores": {
      "اللغة العربية": 68,
      "اللغة الأجنبية الأولى": 58,
      "الرياضيات": 52,
      "الأحياء": 50,
      "الفيزياء": 49,
      "الكيمياء": 52
    }
  },
  "2112": {
    "name": "منه الله محمد ابراهيم محمد ",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 56,
      "الرياضيات": 52,
      "الأحياء": 56,
      "الفيزياء": 55,
      "الكيمياء": 51
    }
  },
  "2113": {
    "name": "يحي محمد حسن محمد",
    "scores": {
      "اللغة العربية": 45,
      "اللغة الأجنبية الأولى": 40,
      "الرياضيات": 40,
      "علم النفس": 58,
      "التاريخ": 56,
      "الجغرافيا": 52
    }
  }
                }

                    
                    
                },
                "literary": {
                    "2113": {
    "name": "يحي محمد حسن محمد",
    "scores": {
      "اللغة العربية": 45,
      "اللغة الأجنبية الأولى": 40,
      "الرياضيات": 40,
      "علم النفس": 58,
      "التاريخ": 56,
      "الجغرافيا": 52
    }
                }
                }
            }
        };

       
